In [26]:
import pandas as pd

## Data Transformation Functions in Pandas(Feature Engineering)
1. Apply()
2. Map()
3. Assign()
4. Replace(old, new)

In [27]:
df = pd.read_csv("raw_data.csv")

In [28]:
print(df)

    id          name   age country   gender    income
0    1      John Doe  29.0     USA     Male   55000.0
1    1      John Doe  29.0     USA     Male   55000.0
2    2    Jane Smith   NaN  Canada   Female   62000.0
3    3          Alex   NaN     USA  Unknown   47000.0
4    4  Maria Garcia  34.0   Spain   Female       NaN
5    5        Li Wei  27.0   China     Male   51000.0
6    6           NaN  45.0   India   Female  730000.0
7    7    Ahmed Khan  38.0     NaN     Male   68000.0
8    8    Rachel Lee  29.0     USA   Female   62000.0
9    9   Carols Ruiz   NaN  Mexico     Male   45000.0
10  10   Emily Davis  31.0     USA   Female   58000.0

In [29]:
#Feature Engineering
df2 = df.copy()

In [30]:
df2["tax"] = df2["income"].apply(lambda x: "20%" if x>=50000 else "10%")

In [31]:
df2

    id          name   age country   gender    income  tax
0    1      John Doe  29.0     USA     Male   55000.0  20%
1    1      John Doe  29.0     USA     Male   55000.0  20%
2    2    Jane Smith   NaN  Canada   Female   62000.0  20%
3    3          Alex   NaN     USA  Unknown   47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female       NaN  10%
5    5        Li Wei  27.0   China     Male   51000.0  20%
6    6           NaN  45.0   India   Female  730000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male   68000.0  20%
8    8    Rachel Lee  29.0     USA   Female   62000.0  20%
9    9   Carols Ruiz   NaN  Mexico     Male   45000.0  10%
10  10   Emily Davis  31.0     USA   Female   58000.0  20%

In [32]:
#Let's convert Male = > M, Female => F, Unknown => U
gender_map = {"Male":"M", "Female":"F", "Unknown":"U"}
df2["gender"] = df2["gender"].map(gender_map)

In [33]:
df2

    id          name   age country gender    income  tax
0    1      John Doe  29.0     USA      M   55000.0  20%
1    1      John Doe  29.0     USA      M   55000.0  20%
2    2    Jane Smith   NaN  Canada      F   62000.0  20%
3    3          Alex   NaN     USA      U   47000.0  10%
4    4  Maria Garcia  34.0   Spain      F       NaN  10%
5    5        Li Wei  27.0   China      M   51000.0  20%
6    6           NaN  45.0   India      F  730000.0  20%
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%
8    8    Rachel Lee  29.0     USA      F   62000.0  20%
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%
10  10   Emily Davis  31.0     USA      F   58000.0  20%

In [34]:
#Let's increase the income of everyone by 10X

df2.assign(new_income=df2["income"]*1.1)

    id          name   age country gender    income  tax  new_income
0    1      John Doe  29.0     USA      M   55000.0  20%     60500.0
1    1      John Doe  29.0     USA      M   55000.0  20%     60500.0
2    2    Jane Smith   NaN  Canada      F   62000.0  20%     68200.0
3    3          Alex   NaN     USA      U   47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain      F       NaN  10%         NaN
5    5        Li Wei  27.0   China      M   51000.0  20%     56100.0
6    6           NaN  45.0   India      F  730000.0  20%    803000.0
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%     74800.0
8    8    Rachel Lee  29.0     USA      F   62000.0  20%     68200.0
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%     49500.0
10  10   Emily Davis  31.0     USA      F   58000.0  20%     63800.0

In [35]:
df2["country"] = df2["country"].replace("USA", "US")

In [36]:
df2

    id          name   age country gender    income  tax
0    1      John Doe  29.0      US      M   55000.0  20%
1    1      John Doe  29.0      US      M   55000.0  20%
2    2    Jane Smith   NaN  Canada      F   62000.0  20%
3    3          Alex   NaN      US      U   47000.0  10%
4    4  Maria Garcia  34.0   Spain      F       NaN  10%
5    5        Li Wei  27.0   China      M   51000.0  20%
6    6           NaN  45.0   India      F  730000.0  20%
7    7    Ahmed Khan  38.0     NaN      M   68000.0  20%
8    8    Rachel Lee  29.0      US      F   62000.0  20%
9    9   Carols Ruiz   NaN  Mexico      M   45000.0  10%
10  10   Emily Davis  31.0      US      F   58000.0  20%